package 자바강의2023.week1;

public class PrimeTest {
    //멤버변수 : 클래스 내부에 선언된 변수
    //클래스 내의 모든 메서드에서 참조
    int a;

    //인스턴스(Instance) 메서드 : static 예약어가 사용되지 않은 메서드
    //반드시 객체 생성 후 호출가능
    //인스턴스 메서드는 같은 클래스 내의 인스턴스 메서드를 직접 호출 가능
    void isPrime() {

        //지역변수 : 메서드 내부에 선언된 변수
        //선언된 메서드 내부에서만 참조 가능
        int b;
    }

    //정적(Static) 메서드 : static 예약어가 붙여진 메서드
    //객체 생성없이 클래스의 이름만으로 호출 가능
    //정적 메서드는 같은 클래스 내에서도 인스턴스 메서드를 직접 호출할 수 없음
    //정적 메서드는 객체를 생성 후 인스턴스 메서드 호출할 수 있음
    public static void main(String[] args) {
        //객체를 생성하기 위해서는
        //1. 객체 참조 변수를 선언
        //2. new 연산자를 이용하여 객체를 생성
        //3. ' = '(대입연산자)를 이용하여 참조 변수에 객체를 대입

        //선언하는 객체 참조 변수의 타입은 객체로 생성할 클래스의 이름
        PrimeTest obj;
        obj = new PrimeTest();

        //객체의 메소드 호출은 참조변수, 메서드명() 형태로 호출
        obj.isPrime();

    }

}